package chapter07;

public class Chapter07_problems {

    // 07_03
    // 상위 클래스로부터 상속 받은 메서드의 기능을
    // 하위 클래스의 특성에 맞게 재정의 하며 그 기능을 더욱 확장할 수 있게 된다.

    // 07_04
    // c. 접근 제어는 더 큰 범위로의 공개만 가능하다.
    // d. 접근 제어와 마찬가지

    // 07_06
    // 상속 관계가 된 상태의 하위 클래스는 인스턴스 생성 시에 힙 영역에 상위 클래스와 함께 생성된다.
    // 때문에 상위 클래스도 초기화 되어야 하고 초기화가 생성자로 인하여 되는

    // 07_08
    // public protected default private
    // d

    // 07_09
    // c. 오버라이딩이 안 됨 / 재정의 불가

    // 07_12
    // c. 지역변수는 어차피 메서드 안에서만 나오니까 접근 제어자를 사용할 필요가 없다.

    // 07_13
    // Math 클래스는 메서드가 모두 static이다.
    // 객체를 생성할 필요가 없기 때문에 private 해도 상관 없음

    // 07_15
    // e. 상위 클래스는 하위 클래스로 형변환 할 수 없다.

    // 07_16
    // e. FireEngine 과 Ambulance 는 같은 선상의 하위 클래스이다.
    // 형변환이 되지 않는다.

    // 07_21
    // Movable 구현 클래스, 하위 클래스

    // 07_24
    // e. 인터페이스의 장점..? protected..?

    // 07_29
    // 지역 클래스 : 메서드 안 클래스
    // 
}
