package chapter06;

public class Chapter06_problems {

    // 6-10
    // b. 생성자는 초기화 목적임
    // e. 생성자는 오버로딩해서 여러 개의 생성자를 만들 수 있음

    // 6-11
    // b. static 이랑은 같이 못 씀

    // 6-12
    // c. 리턴 타입은 상관 없음, 매개 변수 중요
    // d. 매개 변수 이름만 다르고 타입이 같으면 소용 없음

    // 6-13
    // b. 매개 변수 타입이 다름
    // c. 매개 변수 타입이 다름
    // d. 매개 변수 타입이 다름

    // 6-14
    // c. 생성자는 초기화 다음
    // e. 클래스 변수는 실행될 때 먼저 생성됨

    // 6-15
    // 기본값 - 명시적 초기화 - 초기화 블럭 - 생성자
    // a

    // 6-16
    // a. 사용 전에 꼭 초기화 해줘야 한다.
    // e. 스택에 쌓이고 안 쓰면 팝됨

    // 6-17
    // b. 스택에 있다는건 아직 실행 중임, 맨 위에 실행 끝나면 그 아래가 마저 실행됨


}
